Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F03B.tmx
Source language: en_us
Languages: zh_cn

source: You're only 23. Stop rushing life.
zh_cn: 你才23岁，何必活得那么匆忙

source: I asked my CEO today "what can I do to be better" and he responded that it was the fourth time I asked that question in the last month.
zh_cn: 今天，当我问公司老总“要如何才能做得更好”，他说这已经是过去一个月我第四次问他这个问题了。

source: While he appreciated my efforts to always improve and get better, he told me I needed to give it time.
zh_cn: 他告诉我，尽管他很欣赏我为想要变得更好而付出的努力，但我需要给自己一些时间。

source: Whenever I've asked him for feedback in the past, he's always told me that I've done a great job and that if I continue to do what I do, I'll be fine.
zh_cn: 之前每当我向他寻求反馈时，他都会告诉我我的工作已经做得很好，只需要继续保持下去。

source: I thought to myself that that's the worst feedback I can get.
zh_cn: 我暗自思忖，这真是我能得到的最糟糕的回复了。

source: I don't want to be "fine." I want to be great, to be excellent, to be amazing, to be (insert another synonym here).
zh_cn: 我想要的可不仅仅是“很好”，我想要的是“优秀”，是“卓越”，是“完美”，是......（各种你能想到的高度赞赏）。

source: It was almost offensive that I will be "fine" because it sounded like mediocrity.
zh_cn: “很好”这个词太过平庸，让我感觉仿佛受到了冒犯。

source: One of my goals has always been to be the stupidest person in the room so I can surround myself with crazy smart people I can learn from.
zh_cn: 我的众多目标中有一个便是——能成为整间屋子里最蠢的人，因为这样我身边就都是可以让我学习借鉴的聪明人了。

source: That's how I can grow the fastest.
zh_cn: 这样我才能以最快的速度进步。

source: Inadvertently, by doing that, I can't help but compare myself to them.
zh_cn: 但如此一来，我总是会不经意地拿自己和他人进行比较。

source: My CEO sold a multi-million dollar company when he was 28.
zh_cn: 我的老板在28岁的时候，卖掉了一家价值几百万美元的公司。

source: My Product Manager has founded and sold multiple businesses and he's 25.
zh_cn: 我们公司的产品经理在25岁的时候，就已经创立并卖掉了多家企业。

source: That's only 2 years older than me.
zh_cn: 25岁..只比我大2岁啊！

source: When I work day-in-day-out with these two incredibly smart and talented people, I question myself, what have I done?
zh_cn: 我质问自己，天天和这两位如此睿智有才的人并肩工作，我到底做出了什么成绩？

source: If I'm only 2-5 years behind them, what will I have accomplished in that time?
zh_cn: 等再过2-5年，我到了他们现在的年纪，我会做成什么事？

source: The stories about Mark Zuckerberg, Bill Gates, Steve Jobs, and other crazy 20 -something-years-old founders making a dent in the world has created a sense of urgency in us (the all-too-ambitious-millennial-wantrepreneurs).
zh_cn: 我们听过关于扎克伯格、比尔盖茨、乔布斯和其他许多20几岁就开始崭露头角的有志青年的故事，这些太过雄心勃勃的人给我们造成了一种急迫感。

source: It also doesn't help when there are countless stories telling us that there's no better time than now-when we're young, out of school, with nothing to lose.
zh_cn: 而那些类似“刚出校园时的你一无所有不存在失去，正是打拼的最佳时间。

source: Don't wait until you have a family, mortgage, responsibilities, etc.
zh_cn: 不要等到有了家庭、贷款、责任和其他束缚，那时候就晚了”的论调更是多不胜数。

source: This sensation of now has made me very impatient to grow and create value.
zh_cn: 凡此种种对“当下”的关注，让我迫不及待地想要获得成长，去创造价值。

source: I want to get to my goals faster.
zh_cn: 我想要更快地完成我的目标。

source: I want to be better tomorrow.
zh_cn: 我想要每一天都变得更好。

source: I want to learn everything I can so I can go create value ASAP.
zh_cn: 我要想了解一切，这样我才能在最短时间内创造价值。

source: We all have 24 hours in a day and I feel compelled to use every minute in the most productive manner.
zh_cn: 对于每天的24小时，我恨不得把每一分钟都效率最大化。

source: If I'm eating breakfast, I'm watching a tutorial on Udemy; if I'm in transit, I'm listening to a podcast; if I'm waiting for the bus, I'm reading an article on Pocket.
zh_cn: 吃早餐的时候，我会阅读辅导资料；乘坐交通工具时，我会听听播客；如果是在等公交，那我就掏出手机看文章。

source: If I don't, it feels like I'm falling behind.
zh_cn: 如果我不这样做，就会感觉被落在了人后。

source: I remember a few months ago coming back from the Valley where so many people told me that if I wanted to learn as much as I can while working in tech, I needed to move down there.
zh_cn: 我还记得几个月前在硅谷时，人们都告诉我，如果你想在科技创企里学到最多的东西，就最好搬过来。

source: More opportunities, more resources, more talent, more growth.
zh_cn: 这里有更多的机会，更多的资源，更多的能人和更快的成长。

source: It made sense.
zh_cn: 他们说的不无道理。

source: Anyone who wanted to do acting should go to LA, anyone who wanted to do tech/startups should go to SF.
zh_cn: 就好像你想演戏，就得去好莱坞；你想创业，就去旧金山一样。

source: A friend said to me that because there are more opportunities in the Valley, people learn and grow faster, and if I don't go now, I will be falling behind.
zh_cn: 我的一个朋友对我说，硅谷有更多的机会，你能学习和成长的更快。不然就只能落于人后。

source: That scared me. I don't want to fall behind from my peers. I was almost going to pack my bags and move.
zh_cn: 这个说法让我感到惶恐，我不想被同龄人们甩在身后，我差一点就收拾行李搬了过去。

source: When I came back to Toronto, I thought about it a little more.
zh_cn: 当我回到多伦多，深入地思考了一下这个问题。

source: Why did I really want to move to SF?
zh_cn: 为什么我非要搬过去不可呢？

source: Is that what I really wanted?
zh_cn: 这真的是我想要的？

source: And I realized that while my professional ambition is important, so is family, personal development, and balance.
zh_cn: 然后我意识到，尽管我的事业抱负很重要，可我的家庭、个人发展和生活平衡也是一样的重要啊。

source: Knowing that these are my golden years, I should be maximizing my output and giving myself the opportunities to lay the foundation for "success."
zh_cn: 我知道这几年是我的黄金时期，我应该尽可能的拼命，为社会肯定的“成功”打下良好的基础。

source: Once again, I felt guilty that I wanted balance.
zh_cn: 于是忽然间，我有了负罪感，我竟然妄想要生活平衡？

source: And that's just wrong.
zh_cn: 不，这是不对的。

source: While no one's ever going to tell me it's wrong to want balance at my age, our productivity-obsessed culture combined with a sense of urgency shaped this judgment.
zh_cn: 尽管从来没有人跟我说，在我这个年纪谈论生活与工作的平衡是错误的，但急功近利的社会文化和其中暗藏的压迫感塑造出了我的这种价值观。

source: It may be that I work in tech where agile development, speed to market, and scale are always top of focus.
zh_cn: 也许是因为我在科技行业工作，这个行业需要市场快速更新，尽快扩张，且规模总是人们关注的焦点。

source: In this world, if you don't move fast, you can't compete.
zh_cn: 在当今世界，如果你动作慢了，就无竞争力可言。

source: So I treated myself as a startup. Telling myself that I need to be better faster, and that there's a ticking clock to do so.
zh_cn: 所以我把自己当成一家创企来经营，我告诉自己，时不我待，我需要变得更快更强。

source: I just spent the last 3 hours sitting in Indigo after work, picked up a book, and read it cover to cover.
zh_cn: 在写这篇文章前，我花了3个小时泡在书店，选了一本书一页一页地认真阅读。

source: I don't remember when was the last time I did that. I don't know what prompted me to do this either. But it felt great.
zh_cn: 我不记得上次这样做是什么时候，我也不知道是什么促使我今天这样做，但这样的感觉还不赖。

source: I forget what it felt like to be sucked into a good book and have your mind be taken somewhere else.
zh_cn: 我已经快忘了当你全身心沉浸在一本好书中的感觉了。

source: And I forced myself to finish it even though my mind was telling me I had 1000 other things to do and worry about.
zh_cn: 于是我逼着自己把书看完了，尽管我的大脑告诉我我还有1000件事情需要我操心等着我去做。

source: And guess what?
zh_cn: 你猜怎么样？

source: It was OK.
zh_cn: 我觉得还行。

source: Was it productive?
zh_cn: 这算是高效率行动吗？

source: Debatable.
zh_cn: 很难讲。

source: Was it a waste of time?
zh_cn: 这算是浪费时间吗？

source: No.
zh_cn: 不是。

source: Did I sell a company?
zh_cn: 我卖掉一家公司了？

source: Nope.
zh_cn: 也没有。

source: Will I sell a company (or create enough value in society to have monetary returns) in the next 2 years?
zh_cn: 接下来2年我能不能卖掉一家公司（或是为社会创造足够多的价值）？

source: I don't know.
zh_cn: 我不知道。

source: But even if I don't, that's OK.
zh_cn: 即便如此，也没什么大不了的。

source: As long as I have learned something, and that I've created some value in someone's life, today was a good day.
zh_cn: 只要我今天学到了一丁点东西，贡献了一丢丢价值，那就算是不错的一天了。
